In [35]:
import urllib.request
import zipfile
import os
import ssl

try:
    os.mkdir("files")
except:
    pass

ssl._create_default_https_context = ssl._create_unverified_context

with urllib.request.urlopen('https://courses.cs.tau.ac.il/pyProg/2425a/resources/notebook_resources.zip') as f:
    content = f.read()

with open('files/notebook_resources.zip', 'wb') as f:
    f.write(content)

with zipfile.ZipFile('files/notebook_resources.zip', 'r') as zip_ref:
    zip_ref.extractall('files')

print(os.listdir('files'))

import pandas as pd
pd.options.display.max_rows=5

['baby.png', 'countries-of-the-world.csv', 'dialation.png', 'dialation_2.png', 'dog.png', 'dog_noised.png', 'erosion.png', 'erosion_2.png', 'evil_morty_1.png', 'evil_morty_change.png', 'evil_morty_change_3.png', 'evil_morty_change_noised.png', 'evil_morty_segmentation.png', 'ex1.csv', 'ex2.csv', 'koala.png', 'notebook_resources.zip', 'orders_2_2024.csv', 'orders_3_2024.csv', 'orders_4_2024.csv', 'products2.csv', 'ship.png', 'StudentsGrades.csv', 'witcher_1.csv', 'witcher_2.csv', 'woman_noised.png', '__MACOSX']

# עריכה בסיסית של טבלאות וסדרות

In [113]:
inputFileName = "files/StudentsGrades.csv"
df = pd.read_csv(inputFileName)
display(df)

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
0,Yael,50,56,70,60,87,65,91
1,Nadav,61,77,75,75,63,52,88
...,...,...,...,...,...,...,...,...
11,Tom,98,76,98,100,98,92,80
12,Adi,76,87,34,90,88,84,70

### פעולות אריתמטיות בין טבלאות וסדרות

ניתן לבצע מגוון פעולות אריתמטיות בין טבלאות וסדרות.   
הפעולות מבוצעות עבור כל זוג ערכים נמצאים בתא בעל שם תואם ב2 העמודות (element-wise).


נראה כאן כמה דוגמאות:

החסרת עמודות

In [ ]:
print(df['Math'] - df['Art'])

ממוצע בין זוג עמודות ציונים

In [ ]:
print((df['Math'] + df['Art'])/2)

ממוצע בין כל הציונים

In [ ]:
df.iloc[:,1:].mean(axis=1)

```{admonition} **חשבו**
:class: info
מדוע השתמשנו כאן ב`iloc[:,1:]`?
```

```{admonition} **שימו לב**
הקלט `axis=1` בעמודת הממוצעים אומר שבעצם אנו מחשבים **עמודת ממוצעים**, או במילים אחרות, **ממוצע על כל שורה בנפרד שמסתכם לכדי עמודה בודדת**
```

### הסרת שורות ועמודות

על מנת **להסיר שורות או עמודות, נשתמש בפונקציה `pd.drop`**, המחזירה טבלה חדשה ללא השורות/עמודות בעלות השמות שצוינו. ניתן להעביר שם בודד או מספר שמות של שורות/עמודות אותם אנו רוצים להסיר.

הפרמטר `axis` קובע היכן תתבצע ההסרה - בשורות (`axis=0`) או בעמודות (`axis=1`).

דוגמא להסרת העמודה Name:

In [89]:
display(df.drop('Name', axis=1))

,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
0,50,56,70,60,87,65,91
1,61,77,75,75,63,52,88
...,...,...,...,...,...,...,...
11,98,76,98,100,98,92,80
12,76,87,34,90,88,84,70

דוגמא להסרת השורה הראשונה והאחרונה.

In [90]:
display(df.drop([0,12]))

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
1,Nadav,61,77,75,75,63,52,88
2,Michal,81,72,76,94,67,81,78
...,...,...,...,...,...,...,...,...
10,Yaniv,100,64,62,95,61,88,90
11,Tom,98,76,98,100,98,92,80

```{admonition} **שימו לב**
:class: warning

בברירת המחדל הערך של `axis` הוא תמיד 0 - כלומר, הפעולה תתייחס לשורות
```

```{admonition} **שימו לב**
:class: warning
אם השם לא מופיע בציר שצוין, `drop` תקפיץ שגיאה
```

ואם נרצה להסיר את השורות או העמודות מהטבלה המקורית?

במקרה זה, נוכל להשתמש בפרמטר `in_place=True`:

In [114]:
df.drop(0, inplace=True)
display(df)

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
1,Nadav,61,77,75,75,63,52,88
2,Michal,81,72,76,94,67,81,78
...,...,...,...,...,...,...,...,...
11,Tom,98,76,98,100,98,92,80
12,Adi,76,87,34,90,88,84,70

לחלופין, נוכל לבצע השמה למשתנה שמכיל את הטבלה המקורית ולגרום לו להצביע לטבלה החדשה:

In [115]:
df=df.drop(12)
display(df)

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
1,Nadav,61,77,75,75,63,52,88
2,Michal,81,72,76,94,67,81,78
...,...,...,...,...,...,...,...,...
10,Yaniv,100,64,62,95,61,88,90
11,Tom,98,76,98,100,98,92,80

**בהמשך נלמד על דרכים נוספות להסרת שורות ועמודות מטבלה**

### הוספה והסרת שורות ועמודות

הפעולות להלן יודגמו טבלת הציונים `"files/StudentsGrades.csv"`:

In [127]:
inputFileName = "files/StudentsGrades.csv"
df = pd.read_csv(inputFileName)
display(df)

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
0,Yael,50,56,70,60,87,65,91
1,Nadav,61,77,75,75,63,52,88
...,...,...,...,...,...,...,...,...
11,Tom,98,76,98,100,98,92,80
12,Adi,76,87,34,90,88,84,70

כדי להוסיף שורה או עמודה חדשה ל-`DataFrame` קיים (במקרה שלנו, שורה מייצגת סטודנט חדש), ניצור `DataFrame` המכיל שורה או עמודה בודדת, ונשרשר אותה לסוף הטבלה באמצעות פונקצית `pd.concat`.   
פונקציה זו יודעת לחבר מספר טבלאות - המועברות ב`tuple` או ב`list` כפרמטר ראשון לפונקציה - בדרכים שונות. נרחיב על מגוון פעולות חיבור הטבלאות שניתן לעשות באמצעות `concat` ביחידות הבאות.


לצורך **הוספת שורה**, נשתמש בפונקציה `pd.concat` על מנת ליצור **טבלה חדשה**, שהיא למעשה בין הטבלה המקורית ובין הטבלה בעלת השורה הבודדת שיצרנו.

In [125]:
new_student = [{'Name':"Dana",'Programming':76.0,'Marine Biology':65.0,'Stellar Cartography':98.0,'Math':8.07,
                'History':65.0,'Planet Survival':89.0,'Art':100.0}]
pd.DataFrame(new_student)
df_new = pd.concat((df, pd.DataFrame(new_student)))
display(df_new)

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
0,Yael,50.0,56.0,70.0,60.00,87.0,65.0,91.0
1,Nadav,61.0,77.0,75.0,75.00,63.0,52.0,88.0
...,...,...,...,...,...,...,...,...
12,Adi,76.0,87.0,34.0,90.00,88.0,84.0,70.0
0,Dana,76.0,65.0,98.0,8.07,65.0,89.0,100.0

```{admonition} **שימו לב**
:class: warning

לשורה הראשונה והאחרונה יש אותו שם (0). עניין זה יכול ליצור לנו הרבה בפעולות שנרצה לעשות בהמשך (כמו גישה שורות לפי שם).

על מנת להתגבר על בעיה זו, יש להוסיף `ignore_index=True` לפונקציה `concat`. פרמטר זה למעשה "מאפס" את שמות הטבלה ומאתחלן לאידקס רץ מ0 כפי שנעשה כאשר יוצרים טבלה חדשה לחלוטין.

```

לאחר הוספת הפרמטר, הטבלה שחוזרת מ`concat` תראה כך:

In [117]:
df_new = pd.concat((df, pd.DataFrame(new_student)), ignore_index=True)
display(df_new)

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
0,Yael,50.0,56.0,70.0,60.00,87.0,65.0,91.0
1,Nadav,61.0,77.0,75.0,75.00,63.0,52.0,88.0
...,...,...,...,...,...,...,...,...
12,Adi,76.0,87.0,34.0,90.00,88.0,84.0,70.0
13,Dana,76.0,65.0,98.0,8.07,65.0,89.0,100.0


נשתמש בטכניקה דומה על מנת **להוסיף עמודה** בסוף הטבלה, עם הוספת פרמטר ל`concat` - `axis=1`. פרמטר מנחה את הפונקציה לפעול על ציר העמודות, או המילים אחרות, להוסיף **עמודה**. 

לדוגמא להלן השתמשנו ב`concat` על מנת להוסיף את המקצוע גלישה:

In [118]:
inputFileName = "files/StudentsGrades.csv"
df = pd.read_csv(inputFileName)

new_grade = {"Surfing" : [60, 65, 70, 75, 80, 85, 90, 95, 99, 82, 50, 52, 70]}
df_new = pd.concat((df, pd.DataFrame(new_grade)), axis=1)
display(df_new)

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art,Surfing
0,Yael,50,56,70,60,87,65,91,60
1,Nadav,61,77,75,75,63,52,88,65
...,...,...,...,...,...,...,...,...,...
11,Tom,98,76,98,100,98,92,80,52
12,Adi,76,87,34,90,88,84,70,70

```{admonition} **שימו לב**
:class: warning

במקרה זה אין צורך לפרט `ignore_index=True` מכיוון שאנו מוסיפים עמודה, ואנו מניחים שאין עמודה בעלת שם זהה בטבלה.

```

כפי שראינו בהסרת שורות ועמודות, ניתן לבצע השמה למשתנה הטבלה המקורית על מנת להפנות את המשתנה המקורי לטבלה החדשה:

In [119]:
df = pd.concat((df, pd.DataFrame(new_grade)), axis=1)
display(df)

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art,Surfing
0,Yael,50,56,70,60,87,65,91,60
1,Nadav,61,77,75,75,63,52,88,65
...,...,...,...,...,...,...,...,...,...
11,Tom,98,76,98,100,98,92,80,52
12,Adi,76,87,34,90,88,84,70,70

לחלופין, ניתן גם **להוסיף או לעדכן** שורות ועמודות את הטבלה במקורית באמצעות **השמה לפי שם שורה או עמודה**, בדומה למה שעשינו ברשימות (עם `[]iloc`) ובמילונים (עם `[]loc` ו-`[]`).
- עבור `[]loc` ו-`[]` תיווצר עמודה חדשה, במידה לא קיימת כבר עמודה באותו שם. אחרת, העמודה הנוכחית תדרס לפי ערכי עמודה החדשה (כמו במילון).
- עבור `[]iloc` ניתן רק לעדכן ערכי שורה/עמודה קיימת (כמו ברשימה)


לדוגמא, הפעולה למטה תוסיף את ממוצע המקצועות כעמודה חדשה לטבלה המקורית

In [ ]:
df=df.iloc[:,1:].mean(axis=1)
display(df)